---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.IncludeShadingSurfaces
source: html/07a2b379-599f-ae27-1700-03bf0fb5b4b7.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.IncludeShadingSurfaces Property

Indicates if to set and get the setting for if shading surfaces should be included.

## Syntax (C#)
```csharp
public bool IncludeShadingSurfaces { get; }
```